LIUYUTIANABC/Stm32_Platform/STM32F103/Project/ProTimeTriggerSystem_Sch_USART-RS232/Public/usart.c
#include "usart.h"

#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_usart.h"
// #include "stm32f4xx_syscfg.h"
// #include "misc.h"

/*************************************************************************
* Name: Usart1NoInterruptInit
* Function: The Init is not need Interrupt
* Input:
* Output:
*************************************************************************/
void Usart1NoInterruptInit(void)
{
    GPIO_InitTypeDef GPIO_InitStruture;
    USART_InitTypeDef USART_InitStruture;

    // Enable GPIO Rcc clock
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    // USART RCC clock
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

    // Alternate functions: USART1
    // Can not used GPIO_PinSource9 | GPIO_PinSource10 to enable GPIO_PinAFConfig
    // Error: GPIO_PinAFConfig(GPIOA, GPIO_PinSource9 | GPIO_PinSource10, GPIO_AF_USART1);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);

    // GPIO Init
    GPIO_InitStruture.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_10;
    GPIO_InitStruture.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStruture.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStruture.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStruture.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(GPIOA, &GPIO_InitStruture);


    // USART Init
    USART_InitStruture.USART_BaudRate = 9600;
    USART_InitStruture.USART_WordLength = USART_WordLength_8b;
    USART_InitStruture.USART_StopBits = USART_StopBits_1;
    USART_InitStruture.USART_Parity = USART_Parity_No;
    USART_InitStruture.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_InitStruture.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_Init(USART1, &USART_InitStruture);

    // USART Enable
    USART_Cmd(USART1, ENABLE);
    USART_ClearFlag(USART1, USART_FLAG_TC);
}

//------------------------------------------------------------------------
//- Debug No_Interrput function
//------------------------------------------------------------------------
// if (Pwm_Value % 64 == 0)
// {
//     USART_SendData(USART1, Pwm_Value >> 8);
//     while (USART_GetFlagStatus(USART1, USART_FLAG_TC) != SET)
//     {
//         ;
//     }
//     USART_ClearFlag(USART1, USART_FLAG_TC);

//     USART_SendData(USART1, Pwm_Value);
//     while (USART_GetFlagStatus(USART1, USART_FLAG_TC) != SET)
//     {
//         ;
//     }
//     USART_ClearFlag(USART1, USART_FLAG_TC);
// }
// if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == 1)
// {
//     g_Count = USART_ReceiveData(USART1);
//     USART_ClearFlag(USART1, USART_FLAG_RXNE);
//     USART_SendData(USART1, g_Count);
//     while (USART_GetFlagStatus(USART1, USART_FLAG_TC) != SET)
//     {
//         ;
//     }
//     USART_ClearFlag(USART1, USART_FLAG_TC);
// }
